/*
Navicat MySQL Data Transfer

Source Server         : 阿里云数据库
Source Server Version : 50556
Source Host           : localhost:3306
Source Database       : moviedb

Target Server Type    : MYSQL
Target Server Version : 50556
File Encoding         : 65001

Date: 2017-07-18 11:36:44
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `account` varchar(30) NOT NULL,
  `pass` varchar(255) NOT NULL,
  `name` varchar(20) DEFAULT NULL,
  `role` int(1) DEFAULT NULL,
  `status` int(1) DEFAULT '2',
  `addtime` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `unique` (`account`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'adminuser', 'e1adab62a0a474c4988386d5f2380d76', '李旭文', '1', '2', '1499668590');
INSERT INTO `admin` VALUES ('2', 'lixuwen', '93201b23f88ccc56cff8ee5121826fd8', '李旭文', '1', '3', '1499668982');
INSERT INTO `admin` VALUES ('3', 'changtianfei', 'e1adab62a0a474c4988386d5f2380d76', '李旭文', '1', '3', '1499669020');
INSERT INTO `admin` VALUES ('4', 'sangdaheng', 'e1adab62a0a474c4988386d5f2380d76', '李旭文', '1', '3', '1499669055');
INSERT INTO `admin` VALUES ('5', 'lianleilei', 'e1adab62a0a474c4988386d5f2380d76', '连雷雷', '1', '3', '1499669085');

-- ----------------------------
-- Table structure for ceshi
-- ----------------------------
DROP TABLE IF EXISTS `ceshi`;
CREATE TABLE `ceshi` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `picname` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of ceshi
-- ----------------------------
INSERT INTO `ceshi` VALUES ('7', 'http://http://oslfdesgv.bkt.clouddn.com/iwanli/image_15002813042515.jpeg');

-- ----------------------------
-- Table structure for film
-- ----------------------------
DROP TABLE IF EXISTS `film`;
CREATE TABLE `film` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` varchar(50) DEFAULT NULL COMMENT '影片类型',
  `title` varchar(36) DEFAULT NULL,
  `engname` varchar(100) DEFAULT NULL COMMENT '影片英文名称',
  `picname` varchar(200) DEFAULT NULL,
  `firsttime` timestamp NULL DEFAULT NULL COMMENT '首映时间',
  `duration` varchar(255) DEFAULT NULL COMMENT '时长',
  `director` varchar(50) DEFAULT NULL COMMENT '导演',
  `actor` varchar(100) DEFAULT NULL COMMENT '主演',
  `region` varchar(10) DEFAULT NULL COMMENT '地区',
  `introduction` mediumtext,
  `language` varchar(15) DEFAULT NULL,
  `score` float DEFAULT NULL,
  `status` tinyint(4) DEFAULT '1',
  `updated_at` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of film
-- ----------------------------
INSERT INTO `film` VALUES ('1', '动作,冒险,科幻', '变形金刚5：最后的骑士', 'Transformers: The Last Knight', 'ca0ac960ba900395084960270b5b0ad9790739.jpg', '2017-06-27 19:00:00', '150分钟', '迈克尔·贝', '马克·沃尔伯格,伊莎贝拉·莫奈,劳拉·哈德克', '美国', '人类和变形金刚开战，擎天柱失踪，拯救未来的关键就埋藏在历史的秘密之中，那是地球上变形金刚的历史。拯救世界的责任落在一支非同寻常的队伍身上：凯德·伊格尔（马克·沃尔伯格 饰）、大黄蜂、一位英国爵士（安东尼·霍普金斯 饰）还有一位牛津大学教授（劳拉·哈德克 饰）。每个人一生中都会遇到这样一个时刻，它召唤着我们去改变世界。一直被追捕的人将成为英雄，英雄会变成反派。我们和他们的世界，只能存活一个。', '英文', '9.7', '2', '2017-07-17 16:40:35');
INSERT INTO `film` VALUES ('2', '恐怖,惊悚,科幻', '异形：契约', 'Alien: Covenant', '732d8d3f60ae22fbeaa0f5b9cbb32a84391769.jpg', '2017-06-21 17:50:00', '116分钟', '雷德利·斯科特', '迈克尔·法斯宾德,凯瑟琳·沃特斯顿,比利·克鲁德普,卡门·艾乔戈', '美国', '故事发生在《普罗米修斯》10年后，一群新的宇航员乘坐着“契约号”飞船前往遥远的星系寻找殖民地，他们来到一处看似天堂般的星球，实则是黑暗、危险的地狱，在那里他们见到了“普罗米修斯”号唯一的幸存者生化人大卫（迈克尔·法斯宾德 饰），一场毁灭性的巨大灾难即将到来。', '英文', '7.9', '2', '2017-07-03 01:45:14');
INSERT INTO `film` VALUES ('3', '动作,科幻', '逆时营救', 'Reset', 'f724878e35ea40aca285b45ecd8b02631646793.jpg', '2017-06-29 18:00:00', '106分钟', '尹鸿承', '杨幂,霍建华,刘畅', '中国大陆', '夏天（杨幂 饰）是个单亲妈妈，同时也是物理研究所的高级研究员，她多年致力于研究能回到过去的粒子技术，研究即将要成功的一天，夏天发现儿子豆豆（张艺瀚 饰）被神秘绑匪崔琥（霍建华 饰）绑架，崔琥以豆豆性命威胁夏天交出粒子技术，为了挽救豆豆的生命，夏天冒险用未完成的粒子技术返回1小时50分钟前，却令事情变得更加复杂，崔琥的背后故事也渐渐浮出水面。', '中文', '9.2', '2', '2017-07-03 01:44:23');
INSERT INTO `film` VALUES ('4', '1', '冈仁波齐', 'Path of The Soul', '7b1795a13a668935ac80c551016c2eb690110.jpg', '2017-06-20 00:00:00', '117分钟', '张扬', '杨培，尼玛扎堆 ，斯朗卓嘎，次仁曲珍', '中国大陆', '普拉村村民尼玛扎堆在父亲去世后决定完成父亲的遗愿，带着叔叔去拉萨和神山冈仁波齐朝圣。时正马年，正好是神山冈仁波齐百年一遇的本命年，小村里很多人都希望加入尼玛扎堆的朝圣队伍。这支队伍里有即将临盆的孕妇、家徒四壁的屠夫、自幼残疾的少年，每个人都有着不同的故事也怀揣着各自的希望。为了去冈仁波齐，这支十一人的队伍踏上了历时一年，长达2000多里的朝圣之路......', '中文', '7.3', '2', '2017-07-01 09:42:48');
INSERT INTO `film` VALUES ('5', '剧情,战争,历史', '明月几时有', 'Our Time Will Come', '14989003115543.jpg', '2017-07-01 00:00:00', '131分钟', '许鞍华', '周迅 、彭于晏 、霍建华 、郭涛', '大陆上映', '影片讲述了以香港传奇女性“方姑”（周迅 饰）为代表的仁人志士，在1940年代风云变幻的香港展开生死救援的故事。片中，历史上著名的“东江纵队生死大营救”事件是重要的叙事线索——彼时，广东人民抗日游击队根据中共中央指示，克服重重困难，将何香凝、柳亚子、茅盾、邹韬奋等数百文化名人及爱国民主人士成功营救出战火纷飞的香港。', '汉语', '7.3', '2', '2017-07-03 09:27:12');
INSERT INTO `film` VALUES ('6', '喜剧,奇幻', '反转人生', 'Wished', '48bc8193aad5803933d2f6c3af56766f702653.png', '2017-06-29 18:00:00', '110分钟', '伍仕贤', '夏雨 、 闫妮 、潘斌龙 、宋茜', '中国大陆', '主要讲述了保险推销员马奋斗（夏雨 饰）空有满腔抱负却郁郁不得志，在和女朋友姗姗（宋茜 饰）分手后他的人生彻底跌入谷底。然而，神秘人物（闫妮 饰）的出现却颠覆了他的生活轨迹，进而引出了一系列爆笑离奇的反转故事。', '汉语', '8', '2', '2017-07-03 09:57:40');
INSERT INTO `film` VALUES ('7', '喜剧,动画,冒险', '神偷奶爸3', 'Despicable Me 3', 'e4aa7abb6ef5fbe695174063ac6cc0921246361.jpg', '2017-07-07 00:00:00', '90分钟', '皮艾尔·柯芬', '克里斯·雷纳德 、皮艾尔·柯芬 、埃尔希·费舍 、达娜·盖伊', '美国', '影片将延续前两部的温馨搞笑风格，聚焦格鲁和露西的婚后生活，继续讲述格鲁和三个女儿的爆笑故事。', '英文', '8.9', '2', '2017-07-13 11:41:16');
INSERT INTO `film` VALUES ('8', '剧情,惊悚,悬疑', '京城81号2', 'The House That Never DiesⅡ', 'b54ff6d86280f53abde1c46b03f6dea1977483.jpg', '2017-07-06 00:00:00', '93分钟', '钱人豪', '张智霖、梅婷、钟欣潼、耿乐', '大陆上映', '民国末期，正逢乱世，京城军阀哗变，少帅张骘生（张智霖 饰）被逼迎娶大军阀之女纪金翠（钟欣潼 饰），随即府内怪事丛生，人心惶惶。不久后京城涌现大批“尸婴案”，一切矛头指向少帅原配夫人钮梦鹤（梅婷 饰），随后钮梦鹤离奇失踪，一夜之间京城81号惨遭灭门，留下一座破败鬼宅。百年后，文物修复师宋腾在修复古宅过程中挖出大量婴儿尸骨与诡异符咒，一桩桩血淋淋的旧事似乎要将所有人拉进深渊，前世今生的恩怨情仇都一一浮现，而地宫冤魂鬼门索命的故事也就此拉开……', '汉语', '8.3', '1', '2017-07-03 09:50:07');
INSERT INTO `film` VALUES ('9', '剧情,战争,历史', '血战湘江', 'Battle of XiangJiang River', '0d3f773a10e60ea98b1bf34573d02d856663779.jpg', '2017-06-30 00:00:00', '116分钟', '陈力', '王霙 、保剑锋 、  董勇 、  张一山', '中国大陆', '纪念建军九十周年、迎十九大重点影片《血战湘江》讲述了83年前红军付出巨大牺牲血战湘江的悲壮故事，直面表现了红军将士满怀对革命的无限忠诚、对党的坚定信念，在巨大困难和强大敌人面前，不怕任何艰难险阻，不惜付出一切牺牲，以大无畏的英雄气概和必胜的信念，誓死保卫党中央，胜利突破敌人第四道封锁线，挫败了国民党反动派集中重兵消灭我党和红军的图谋，确保了革命事业在血与火的征程中不断发展，创造了气吞山河的人间奇迹，谱写了豪情万丈的英雄史诗。', '汉语', '9.3', '2', '2017-07-03 10:07:17');
INSERT INTO `film` VALUES ('10', '剧情,动作,奇幻', '悟空传', 'The Legend of Wu Kong', '14990508546835.jpeg', '2017-07-13 00:00:00', '123分钟', '郭子健', '彭于晏 、倪妮 、欧豪 、 余文乐', '中国大陆', '电影《悟空传》改编自今何在同名小说，讲述了在大闹天宫的五百年前，未成为齐天大圣的孙悟空，不服天命，向天地诸神发起抗争的故事。这不是西游记的任何章节，这是悟空（彭于晏 饰）的故事，彼时孙悟空还不是震撼天地的齐天大圣，他只是只桀傲不驯的猴子。天庭毁掉他的花果山以掌控众生命运，他便决心跟天庭对抗，毁掉一切戒律。在天庭，孙悟空遇到不能爱的阿紫（倪妮 饰），一生的宿敌杨戬（余文乐 饰），和思念昔日爱人阿月（郑爽 饰）的天蓬（欧豪 饰），他们的身份注定永生相杀，但其实不甘命运摆布的又何止孙悟空一人？却没想到反抗却带来更大的浩劫。他们所做的一切，究竟是不知天高地厚的热血轻狂，还是无奈宿命难改的压抑绝望？难道命运真的早已注定？悟空不服，他再次挥动金箍棒，要让这诸佛都烟消云散！', '汉语', null, '2', '2017-07-17 15:16:22');
INSERT INTO `film` VALUES ('11', '爱情,奇幻,古装', '三生三世十里桃花', 'ONCE UPON A TIME', '14990512888124.png', '2017-08-04 00:00:00', null, '赵小丁', '刘亦菲 、杨洋 、彭子苏', '中国大陆', '天族战神墨渊镇压鬼君擎苍于无妄海，魂飞魄散，仙体冰封于青丘炎华洞内。青丘帝姬白浅同天族太子夜华早有婚约，二人却一直未曾相见。直至东海盛宴，夜华发现白浅竟然同亡妻素素相貌一样，就势住进白浅的青丘，放下太子身段，为求解开白浅与素素之谜。夜华侧妃素锦生妒，暗中协助鬼族王后玄女抢走墨渊仙体。白浅一怒之下血战鬼族大紫明宫，身负重伤，终被夜华救下。白浅跟随夜华来到九重天，通过天族圣器结魄灯恢复记忆，回想起身为素素一世之时所受伤害，不能原谅夜华。陷害白浅的素锦受到责罚，发配至无妄海，由妒生恨，终至疯狂，利用夜华之子小天孙阿离之血释放出被墨渊封印的鬼君擎苍。夜华为维护四海八荒，以元神生祭东皇钟，将擎苍封印。世事轮回，万般纠葛不过一个爱字。命运轮回，夜华与白浅究竟何去何从……', '汉语', null, '1', '2017-07-03 03:09:42');
INSERT INTO `film` VALUES ('12', '剧情,动作,战争', '战狼2', 'Wolf Warriors Ⅱ', '14990514908424.jpeg', '2017-07-28 00:00:00', '100分钟', '吴京', '吴京 、弗兰克·格里罗 、  卢靖姗 、  吴刚', '中国大陆', '冷锋将卷入一场非洲国家的叛乱，本可以安全撤离的他，因无法忘记军人的使命，不丢下身陷囹圄的同胞和难民们，只身犯险冲回沦陷区，带领所有被困民众向邻国大逃亡。', '汉语', null, '1', '2017-07-03 03:13:26');
INSERT INTO `film` VALUES ('13', '动作,冒险,奇幻', '神奇女侠', 'Wonder Woman', '14990519731493.jpeg', '2017-06-02 00:00:00', '142分钟', '派蒂·杰金斯', '盖尔·加朵 、克里斯·派恩 、罗宾·怀特', '美国', '故事讲述亚马逊公主戴安娜·普林斯（盖尔·加朵 饰），经过在家乡天堂岛的训练，取得上帝赐予的武器与装备，化身神奇女侠，与空军上尉史蒂夫·特雷弗（克里斯·派恩 饰）一同来到人类世界，一起捍卫和平、拯救世界，在一战期间上演了震撼人心的史诗传奇。', '英语', '8.6', '2', '2017-07-03 03:21:13');
INSERT INTO `film` VALUES ('14', null, null, null, '14990527424594.jpeg', null, null, null, null, null, null, null, null, null, null);
INSERT INTO `film` VALUES ('15', '喜剧,科幻,奇幻', '喵星人', null, '14999180417069.jpeg', '2017-07-14 00:00:00', '109分钟', '陈木胜', '古天乐、马丽 、 刘楚恬', '中国大陆', '千百年来，地球上一直住着一种外星生物，名叫喵星人。它们从遥远的喵星来到地球，化身为猫科动物，分散在世界每个角落。萌萌的外表，加上机智聪明的头脑，轻易就得到人类的宠爱。不愁吃喝的它们桀骜不驯，活像饱经沧桑的江湖大佬。犀犀利就是他们中的一员，作为一名正牌的喵星来客，它肩负使命长途跋涉来到地球，却意外遇到了吴守龙（古天乐 饰）一家，上演了一幕相运相生，喵趣横生的人猫奇遇记。', '汉语', null, '1', null);
INSERT INTO `film` VALUES ('16', '动作,古装,武侠', '绣春刀·修罗战场', null, '14999182724268.jpeg', '2017-07-19 00:00:00', '120分钟', '路阳', '张震、杨幂、张译、雷佳音', '中国大陆', '讲述了明朝天启七年，北镇抚司锦衣卫沈炼（张震 饰）在追查案件中身陷阴谋，为了证明清白，沈炼与少女北斋（杨幂 饰），同僚裴纶（雷佳音饰）协力查明真相的故事。', '汉语', null, '1', null);
INSERT INTO `film` VALUES ('18', '动作', '青禾男高', null, '15002766852083.jpeg', '2017-07-17 00:00:00', '120分钟', '蒋卓原', '蒋卓原', '大陆', '阿道夫', '汉语', null, '2', null);

-- ----------------------------
-- Table structure for film_comment
-- ----------------------------
DROP TABLE IF EXISTS `film_comment`;
CREATE TABLE `film_comment` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(11) DEFAULT NULL,
  `uid` int(11) DEFAULT NULL,
  `comment` mediumtext,
  `support` int(10) DEFAULT NULL,
  `created_at` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of film_comment
-- ----------------------------
INSERT INTO `film_comment` VALUES ('1', '6', '2', '早就想看了 ，今天终于有时间了。', '23', '1499410026');
INSERT INTO `film_comment` VALUES ('2', '6', '4', '很好看的一部电影。值得一看。', '1', '1499410026');
INSERT INTO `film_comment` VALUES ('3', '9', '3', '一部很好看的红色电影，作为退伍兵的我，仿佛血又沸腾了起来', '1', '1499410374');
INSERT INTO `film_comment` VALUES ('4', '1', '4', '从第一部一直追过来，拍的好不好已经不重要了，重要的是一种情怀！', '1', '1499416047');
INSERT INTO `film_comment` VALUES ('5', '2', '5', '比较纠结的评分。 跟异形1.2.3一样的套路：人类的狂妄、自大、恐惧，结局也是意料中的反转。感觉所有剧情都在意料之中，每一部基本上都是全体灭绝，只不过以前剩一个人，这次一个不剩。 不过这一部没有像往常一样去赞美异形的强大与完美。 And，沿袭《普罗米修斯》的剧情，却又用一个剧情片段把《普罗米修斯》的剧情给改写了，不知道几个意思，寻找主线剧情？ 感觉导演还在试坑，主线剧情没想好的样子 Ծ‸Ծ 异形倒真是变漂亮了… 总觉得每一部的人类，都不冷静、不理智…', '1', '1499416212');
INSERT INTO `film_comment` VALUES ('6', '2', '3', '等了五年，太让人失望了。上一集的女主角死的不明不白，探索人类起源也没有任何的进展！', '1', '1499416233');
INSERT INTO `film_comment` VALUES ('7', '2', '4', '看着想睡觉的人麻烦就别评论了，难得的精彩科幻大片。被你们评个6.7分！大多数国人这种扭曲的价值观不适合看此片。 我认为就工程师们死的太简单了，那么发达的文明轻易就被ko！或许工程师还有其他的殖民星球对吧。契约这部电影值得观看，精彩', '1', '1499416274');
INSERT INTO `film_comment` VALUES ('8', '3', '4', '电影刚开场20分钟我就看不下去了，不管是剧情特效演员演技都好尴尬，一点看点都没有，给我的感觉连台词都没背熟，她们自己都不知道自己在说一些什么东西，开场半个小时了也没什么惊心动魄的场面，烂到爆！', '1', '1499416315');
INSERT INTO `film_comment` VALUES ('9', '4', '4', '震撼灵魂的电影，寥寥无几的排场。这样真实的电影门可罗雀，谁之过？那些吵着要去西藏净化心灵洗涤灵魂的矫情货就该进影院来看看，没有这份信仰和虔诚，你不过就是个游客，冈仁波齐布达拉宫大昭寺也就是个景点罢了，别站在拉萨拍几张照，就说向往已久，真可笑之极。', '1', '1499416367');
INSERT INTO `film_comment` VALUES ('10', '6', '5', '很不错，今天刚看', '1', '1499436558');
INSERT INTO `film_comment` VALUES ('11', '3', '5', '演员也好，剧情也好', '1', '1499437877');
INSERT INTO `film_comment` VALUES ('12', '12', '5', '很期待看', '1', '1499669061');
INSERT INTO `film_comment` VALUES ('13', '7', '4', '小黄人好可爱', '1', '1500013034');
INSERT INTO `film_comment` VALUES ('14', '1', '4', '大爱这部电影', '1', '1500274476');
INSERT INTO `film_comment` VALUES ('15', '7', '4', '小黄人小黄人', '1', '1500274546');
INSERT INTO `film_comment` VALUES ('16', '18', '6', '好看', '1', '1500277691');
INSERT INTO `film_comment` VALUES ('17', '6', '4', '大叔大婶多', '1', '1500279082');
INSERT INTO `film_comment` VALUES ('18', '2', '4', '很好看', '1', '1500280312');
INSERT INTO `film_comment` VALUES ('19', '2', '4', '很好看', '1', '1500280799');

-- ----------------------------
-- Table structure for hall
-- ----------------------------
DROP TABLE IF EXISTS `hall`;
CREATE TABLE `hall` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cid` int(11) DEFAULT NULL COMMENT '商家的id',
  `cowsnumber` int(11) DEFAULT NULL COMMENT '列数',
  `seatnumber` int(11) DEFAULT NULL COMMENT '每排座位数量',
  `sumnumber` int(11) DEFAULT NULL COMMENT '座位总数量',
  `title` varchar(20) DEFAULT NULL COMMENT '布局名称',
  `layout` text COMMENT '座位布局',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of hall
-- ----------------------------
INSERT INTO `hall` VALUES ('1', '1', '8', '15', '105', '1号厅', '{\"0\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"1\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"2\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"3\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"4\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"5\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"6\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"7\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"]}');
INSERT INTO `hall` VALUES ('2', '1', '10', '12', '100', '2号厅', '{\"0\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"1\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"2\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"3\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"4\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"5\":[\"a\",\"a\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"a\",\"a\"],\"6\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"7\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"8\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"9\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"]}');
INSERT INTO `hall` VALUES ('3', '1', '15', '15', '188', '3号厅', '{\"0\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"1\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"2\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"3\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"4\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"5\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"6\":[\"a\",\"a\",\"a\",\"a\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"a\",\"a\",\"a\",\"a\"],\"7\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"8\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"9\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"10\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"11\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"12\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"13\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"14\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"]}');
INSERT INTO `hall` VALUES ('4', '2', '15', '12', '152', '1号厅', '{\"0\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"1\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"2\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"3\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"4\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"5\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"6\":[\"_\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"_\",\"_\",\"_\"],\"7\":[\"_\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"_\",\"_\",\"_\"],\"8\":[\"_\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"_\",\"_\",\"_\"],\"9\":[\"_\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"_\",\"_\",\"_\"],\"10\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"11\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"12\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"13\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"14\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"]}');
INSERT INTO `hall` VALUES ('5', '2', '12', '15', '150', '2号厅', '{\"0\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"1\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"2\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"3\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"4\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"],\"5\":[\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\",\"_\"],\"6\":[\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\"],\"7\":[\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\"],\"8\":[\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\"],\"9\":[\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\"],\"10\":[\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\",\"a\",\"a\",\"_\",\"a\",\"a\"],\"11\":[\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\",\"a\"]}');
INSERT INTO `hall` VALUES ('6', '1', '6', '5', '25', '6号布局', '\"{\\\"0\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"1\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"2\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"3\\\":[\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\"],\\\"4\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"5\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"]}\"');
INSERT INTO `hall` VALUES ('7', '1', '7', '15', '91', '7号影厅', '\"{\\\"0\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"1\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"2\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"3\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"4\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"5\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"6\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"]}\"');
INSERT INTO `hall` VALUES ('8', '4', '9', '10', '80', '1号厅', '\"{\\\"0\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"1\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"2\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"3\\\":[\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\"],\\\"4\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"5\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"6\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"7\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"8\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"]}\"');
INSERT INTO `hall` VALUES ('9', '4', '11', '10', '100', '2号厅', '\"{\\\"0\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"1\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"2\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"3\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"4\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"5\\\":[\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\"],\\\"6\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"7\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"8\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"9\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"10\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"]}\"');
INSERT INTO `hall` VALUES ('10', '1', '7', '18', '96', '6号厅', '\"{\\\"0\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"1\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"2\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"3\\\":[\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\",\\\"_\\\"],\\\"4\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"5\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"],\\\"6\\\":[\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"_\\\",\\\"_\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\",\\\"a\\\"]}\"');

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news` (
  `id` mediumint(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(80) NOT NULL COMMENT '资讯标题',
  `thumb` varchar(100) NOT NULL,
  `description` mediumtext NOT NULL,
  `content` mediumtext NOT NULL COMMENT '文章内容',
  `status` tinyint(2) unsigned NOT NULL DEFAULT '0' COMMENT '资讯状态：1发布，0待审核',
  `created_at` int(10) NOT NULL,
  `updated_at` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES ('9', '刘亦菲干爹与冯女郎街头热吻！15年就同框年龄差30岁', 'img_2a5581ad5b9ab7b4f2a8fe2b41ca3f19.png', '近日，有媒体拍到冯小刚新电影《芳华》的女主角杨采钰和刘亦菲干爹陈金飞，当街热吻浓情蜜意，随后还同回住宅共度良宵，疑似已经同居。', '据悉，1962年出生的陈金飞和1992年出生的杨采钰，两人年龄相差30岁，2015年就曾被拍到电梯热吻。只可惜在一起这么久了才当上电影女主角～\r\n自从2015年两人被拍到电梯热吻恋情曝光后，就一直保持低调没有什么消息，<br/>就在近日，刘亦菲干爹陈金飞被拍到带着92年的小女友杨采钰出门会友吃饭，饭后几人站在门口聊天，陈金飞穿着白色衬衣和蓝色牛仔裤，杨采钰则穿着白色背心斜挎着黑色包包，清凉又性感。\r\n两男两女围站一圈，陈金飞与一名男士高谈阔论，聊得十分开心，尤其陈金飞不停说话还时不时用手比划，而站在一旁的两位女士却似乎有些无聊，只默默听着几乎不说话。\r\n聊了好一会儿，不知道另一位女士说了什么好笑的事情，杨采钰笑得前仰后合，陈金飞忍不住上前抱住了杨采钰，随后更是在她的侧脸和嘴唇上亲吻了起来……\r\n而杨采钰的长相跟刘亦菲也颇为神似，看来金主爸爸都喜欢这一挂的啊～', '0', '1499312416', '1499312416');
INSERT INTO `news` VALUES ('8', '当女王变成女汉子，郭采洁：我只能靠戴假发来圆梦', 'img_5b5e1bfd4d24f5baa57289cbc643105c.png', '当女王变成女汉子，郭采洁：我只能靠戴假发来圆梦', '如果你看到《绝世高手》里郭采洁的演出，一定会大跌眼镜。而在此之前，你对她的印象可能只禁锢在”顾里“这个角色里头。在饰演顾里以前，郭采洁是走小清新的路线。2013年，郭敬明找到了她，让她饰演《小时代》里的顾里，没想到，歪打正着，一下就红透半边天。', '0', '1499312068', '1499312068');
INSERT INTO `news` VALUES ('13', '《神偷奶爸3》 4.3亿夺冠，刷新动画首周纪录，《变5》将破15亿', '95d1cad3f73732811f7e14616c2add2f.jpg', '猫眼电影讯 2017年第27周的内地周票房最终定格在10.24亿，成为今年第11个单周票房破10亿的一周。', '<p>&nbsp; &nbsp; &nbsp;猫眼电影讯 2017年第27周的内地周票房最终定格在10.24亿，成为今年第11个单周票房破10亿的一周。\r\n\r\n\r\n\r\n照明动画系列的《神偷奶爸3》首周3日斩获4.39亿，位列票房冠军。上映了3周的《变形金刚5：最后的骑士》以1.51亿位列亚军。国产恐怖片《京城81号2》凭借1.39亿坐拥第三。\r\n\r\n从大盘来看，第27周的单周票房相比前一周的8.71亿，上涨17.5%。与去年同期《寒战2》夺冠的周票房（11.64亿）相比，则小幅回落12%。\r\n\r\n·《神偷奶爸3》夺冠，小黄人继续兴风作浪\r\n照明动画的《神偷奶爸3》首周票房拿到4.3亿，相比前作《神偷奶爸2》9557万人民币的首周成绩，进步不止一点点。更重要的是，它成功刷新了《功夫熊猫3》3.39亿的动画片首周票房纪录。\r\n &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>', '0', '1499668461', '1499845701');
INSERT INTO `news` VALUES ('18', '测试', '318eaf9e07a42e3a6a7332e474353268.jpg', 'ad', '<p>测试</p>', '0', '1500277883', '1500277883');
INSERT INTO `news` VALUES ('17', '网剧《端脑》首曝海报，朱元冰杨奇煜赵奕欢亮相漫展', '95f7eba3fc998fb241650a6a3cdd0617.jpg', '网剧《端脑》首曝海报，朱元冰杨奇煜赵奕欢亮相漫展', '<p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\">猫眼电影讯 科幻悬疑网剧《端脑》由搜狐视频和留白影视联合出品，改编自壁水羽同名漫画，于中中执导，戚薇任艺术总监，朱元冰、蒋依依、黄一琳、杨奇煜、谢佳见等领衔主演，赵奕欢特别出演，将于今年秋季独家登陆搜狐视频。今日，该剧公布了全员版海报，首次曝光超豪华、高颜值的主演阵容。此外，网剧《端脑》即将强势登陆</span><span style=\"color: rgb(34, 34, 34);\">7</span><span style=\"color: rgb(34, 34, 34);\">·</span><span style=\"color: rgb(34, 34, 34);\">15</span><span style=\"color: rgb(34, 34, 34);\">广州萤火虫动漫嘉年华，朱元冰、杨奇煜、赵奕欢等主演将现场带领粉丝实感体验“端脑世界”。</span><br/></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\"><br/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\"><img src=\"http://localhost/movie/newtickets/storage/app/public/uploads/20170712/6a527ed492ca6d54185100895a8e8ac4.jpg\" title=\"/uploads/20170712/6a527ed492ca6d54185100895a8e8ac4.jpg\" alt=\"351d92245293286d8394dfce188c63b6872692.jpg\"/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"font-weight: bolder;\"><br/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"font-weight: bolder;\">全员海报首次曝光 被赞高颜值神还原</span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; white-space: normal; background-color: rgb(255, 255, 255);\">《端脑》作<span style=\"color: rgb(34, 34, 34);\">为有妖气三大IP之一，长期位居有妖气经典排行榜第一名，点击量超21亿，被称为“扛鼎国漫”，自真人化消息公布一来，引发无数动漫圈、科幻圈专业人士期待。今日，网剧《端脑》曝光首张全员版海报，六大主演悉数亮相端脑大厅，高完成度和高还原度备受粉丝好评。</span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\"><br/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\">海报中，六人一字排开严阵以待，朱元冰饰演的夏驰手持端脑卡，意欲突破两个世界；蒋依依饰演的晴知被反剪双手，无助等待；杨奇煜饰演的孟秦背身转头，呈现戒备状态；赵奕欢饰演的I7则持枪以待，黄一琳饰演的春絮香面带微笑散发危险魅力，谢佳见饰演的博卞气定神闲仿若胜券在握。六人服装以黑白为主色调，与端脑大厅蓝黑色调的科技感相互呼应，可谓十分亮眼。</span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\"><br/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"font-weight: bolder;\"><span style=\"color: rgb(34, 34, 34);\">朱元冰杨奇煜赵奕欢将空降漫展 高还原端脑大厅现身</span></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\">在即将举办的广州萤火虫动漫嘉年华，网剧《端脑》强势登陆，现场一比一神还原剧中端脑大厅，朱元冰、杨奇煜、赵奕欢三位主演将空降现场与粉丝见面，更会在端脑大厅与粉丝一同重温《端脑》经典游戏。现场不仅能亲自感受《端脑》的烧脑，还能获得第一手相关信息，与主演一起感受烧脑节奏。</span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\"><span style=\"color: rgb(34, 34, 34);\"><br/></span></p><p style=\"margin-top: 0px; margin-bottom: 0px; line-height: 1.75; color: rgb(51, 51, 51); font-family: &quot;Microsoft YaHei&quot;, Helvetica, Arial, sans-serif; text-align: justify; white-space: normal; background-color: rgb(255, 255, 255);\">网剧《端脑》由于中中执导，戚薇担任艺术总监，朱元冰、蒋依依、黄一琳、杨奇煜、谢佳见等领衔主演，赵奕欢特别出演，预计将于今年秋季独家登陆搜狐视频。</p><p><br/></p>', '0', '1499846531', '1499846531');

-- ----------------------------
-- Table structure for orders
-- ----------------------------
DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `totalprice` decimal(8,2) DEFAULT NULL,
  `seat` varchar(255) DEFAULT NULL,
  `playtime` datetime DEFAULT NULL,
  `addtime` datetime DEFAULT NULL,
  `ispay` int(1) DEFAULT '1',
  `number` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of orders
-- ----------------------------
INSERT INTO `orders` VALUES ('1', '55.00', '6排8座', '2017-07-17 04:00:00', '2017-07-17 09:51:00', '1', '38262');
INSERT INTO `orders` VALUES ('2', '55.00', '6排5座', '2017-07-17 04:00:00', '2017-07-17 09:51:01', '1', '89104');
INSERT INTO `orders` VALUES ('3', '55.00', '1排10座', '2017-07-17 12:10:00', '2017-07-17 14:39:28', '1', '50168');
INSERT INTO `orders` VALUES ('4', '55.00', '1排11座', '2017-07-17 12:10:00', '2017-07-17 14:39:28', '1', '99686');
INSERT INTO `orders` VALUES ('5', '55.00', '1排7座', '2017-07-18 01:01:00', '2017-07-17 14:43:42', '1', '55793');
INSERT INTO `orders` VALUES ('6', '55.00', '1排8座', '2017-07-18 01:01:00', '2017-07-17 14:43:42', '1', '40390');
INSERT INTO `orders` VALUES ('7', '55.00', '7排13座', '2017-07-17 12:10:00', '2017-07-17 14:41:57', '1', '72984');
INSERT INTO `orders` VALUES ('8', '55.00', '7排14座', '2017-07-17 12:10:00', '2017-07-17 14:41:58', '1', '75360');
INSERT INTO `orders` VALUES ('9', '55.00', '9排6座', '2017-07-18 10:00:00', '2017-07-17 14:46:31', '1', '62198');
INSERT INTO `orders` VALUES ('10', '55.00', '8排7座', '2017-07-18 10:00:00', '2017-07-17 14:46:31', '1', '80540');
INSERT INTO `orders` VALUES ('11', '35.00', '1排1座', '2017-07-17 02:02:00', '2017-07-17 15:34:45', '1', '57466');
INSERT INTO `orders` VALUES ('12', '35.00', '1排2座', '2017-07-17 02:02:00', '2017-07-17 15:34:45', '1', '34829');
INSERT INTO `orders` VALUES ('13', '35.00', '1排3座', '2017-07-17 02:02:00', '2017-07-17 15:34:46', '1', '86613');
INSERT INTO `orders` VALUES ('14', '35.00', '3排3座', '2017-07-17 02:02:00', '2017-07-17 15:41:53', '1', '82372');
INSERT INTO `orders` VALUES ('15', '35.00', '3排4座', '2017-07-17 02:02:00', '2017-07-17 15:41:53', '1', '59163');
INSERT INTO `orders` VALUES ('16', '88.00', '1排1座', '2017-07-17 17:01:00', '2017-07-17 15:45:07', '1', '57754');
INSERT INTO `orders` VALUES ('17', '88.00', '1排2座', '2017-07-17 17:01:00', '2017-07-17 15:45:07', '1', '53731');
INSERT INTO `orders` VALUES ('18', '35.00', '3排5座', '2017-07-17 02:02:00', '2017-07-17 15:59:19', '1', '75102');
INSERT INTO `orders` VALUES ('19', '35.00', '3排6座', '2017-07-17 02:02:00', '2017-07-17 15:59:20', '1', '69592');
INSERT INTO `orders` VALUES ('20', '35.00', '6排8座', '2017-07-17 02:02:00', '2017-07-17 15:59:20', '1', '10450');
INSERT INTO `orders` VALUES ('21', '35.00', '6排7座', '2017-07-17 02:02:00', '2017-07-17 15:59:21', '1', '86135');
INSERT INTO `orders` VALUES ('22', '35.00', '4排4座', '2017-07-17 11:16:00', '2017-07-17 16:17:24', '1', '16800');

-- ----------------------------
-- Table structure for projection
-- ----------------------------
DROP TABLE IF EXISTS `projection`;
CREATE TABLE `projection` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `fid` int(11) DEFAULT NULL COMMENT '影片信息id',
  `cid` int(11) DEFAULT NULL COMMENT '影院id',
  `hid` int(11) DEFAULT NULL COMMENT '影厅信息',
  `datetime` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '放映时间',
  `endtime` datetime DEFAULT NULL,
  `price` decimal(10,0) DEFAULT NULL COMMENT '价格',
  `seatinfo` varchar(20) DEFAULT NULL COMMENT '座位信息',
  `status` varchar(255) DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of projection
-- ----------------------------
INSERT INTO `projection` VALUES ('1', '1', '1', '1', '2017-07-17 04:00:00', '2017-07-17 07:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('2', '2', '1', '1', '2017-07-17 12:10:00', '2017-07-17 14:00:00', '55', '有座', '1');
INSERT INTO `projection` VALUES ('3', '5', '1', '2', '2017-07-17 17:01:00', '2017-07-17 19:00:00', '88', '充足', '1');
INSERT INTO `projection` VALUES ('4', '2', '1', '1', '2017-07-18 01:01:00', '2017-07-18 03:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('5', '6', '1', '2', '2017-07-18 10:00:00', '2017-07-18 12:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('6', '1', '2', '4', '2017-07-17 10:10:00', '2017-07-17 12:12:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('7', '3', '2', '4', '2017-07-17 18:10:00', '2017-07-17 20:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('8', '1', '2', '5', '2017-07-18 10:10:00', '2017-07-18 12:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('9', '6', '2', '5', '2017-07-18 21:00:00', '2017-07-18 10:10:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('10', '4', '4', '8', '2017-07-17 11:00:00', '2017-07-17 12:58:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('11', '5', '4', '8', '2017-07-17 15:10:00', '2017-07-17 17:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('12', '2', '4', '9', '2017-07-18 10:07:00', '2017-07-18 12:00:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('13', '10', '1', '2', '2017-07-10 00:22:00', '2017-07-10 14:20:00', '35', '120', '1');
INSERT INTO `projection` VALUES ('14', '10', '1', '1', '2017-07-17 04:01:00', '2017-07-17 14:03:00', '35', '120', '1');
INSERT INTO `projection` VALUES ('15', '10', '1', '3', '2017-07-17 12:12:00', '2017-07-17 14:11:00', '99', '充足', '1');
INSERT INTO `projection` VALUES ('16', '10', '1', '3', '2017-07-17 12:12:00', '2017-07-17 14:11:00', '99', '充足', '1');
INSERT INTO `projection` VALUES ('17', '10', '1', '3', '2017-07-17 18:11:00', '2017-07-17 20:11:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('18', '10', '1', '3', '2017-07-17 18:11:00', '2017-07-17 20:11:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('19', '10', '1', '2', '2017-07-17 01:02:00', '2017-07-17 15:02:00', null, null, '1');
INSERT INTO `projection` VALUES ('20', '10', '1', '2', '2017-07-17 18:12:00', '2017-07-17 19:12:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('21', '10', '1', '2', '2017-07-17 18:12:00', '2017-07-17 19:12:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('22', '10', '1', '7', '2017-07-17 19:11:00', '2017-07-17 21:21:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('23', '10', '1', '7', '2017-07-17 19:11:00', '2017-07-17 21:21:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('24', '18', '1', '1', '2017-07-17 02:02:00', '2017-07-17 04:01:00', '35', '100', '1');
INSERT INTO `projection` VALUES ('25', '10', '1', '1', '2017-07-18 11:11:00', '2017-07-18 14:15:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('26', '10', '1', '2', '2017-07-17 11:11:00', '2017-07-17 15:15:00', '55', '充足', '1');
INSERT INTO `projection` VALUES ('27', '13', '1', '2', '2017-07-17 11:16:00', '2017-07-17 13:11:00', '35', '120', '1');
INSERT INTO `projection` VALUES ('28', '18', '1', '2', '2017-07-17 17:19:00', '2017-07-17 18:05:00', '35', '120', '1');

-- ----------------------------
-- Table structure for rel_orders
-- ----------------------------
DROP TABLE IF EXISTS `rel_orders`;
CREATE TABLE `rel_orders` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(11) DEFAULT NULL COMMENT '用户id',
  `pid` int(11) DEFAULT NULL COMMENT '放映信息id',
  `sid` int(11) DEFAULT NULL COMMENT '商家id',
  `oid` int(11) DEFAULT NULL COMMENT '订单id',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of rel_orders
-- ----------------------------
INSERT INTO `rel_orders` VALUES ('1', '2', '1', '1', '1');
INSERT INTO `rel_orders` VALUES ('2', '2', '1', '1', '2');
INSERT INTO `rel_orders` VALUES ('3', '4', '2', '1', '3');
INSERT INTO `rel_orders` VALUES ('4', '4', '2', '1', '4');
INSERT INTO `rel_orders` VALUES ('5', '4', '4', '1', '5');
INSERT INTO `rel_orders` VALUES ('6', '4', '4', '1', '6');
INSERT INTO `rel_orders` VALUES ('7', '2', '2', '1', '7');
INSERT INTO `rel_orders` VALUES ('8', '2', '2', '1', '8');
INSERT INTO `rel_orders` VALUES ('9', '2', '5', '1', '9');
INSERT INTO `rel_orders` VALUES ('10', '2', '5', '1', '10');
INSERT INTO `rel_orders` VALUES ('11', '6', '24', '1', '11');
INSERT INTO `rel_orders` VALUES ('12', '6', '24', '1', '12');
INSERT INTO `rel_orders` VALUES ('13', '6', '24', '1', '13');
INSERT INTO `rel_orders` VALUES ('14', '6', '24', '1', '14');
INSERT INTO `rel_orders` VALUES ('15', '6', '24', '1', '15');
INSERT INTO `rel_orders` VALUES ('16', '4', '3', '1', '16');
INSERT INTO `rel_orders` VALUES ('17', '4', '3', '1', '17');
INSERT INTO `rel_orders` VALUES ('18', '6', '24', '1', '18');
INSERT INTO `rel_orders` VALUES ('19', '6', '24', '1', '19');
INSERT INTO `rel_orders` VALUES ('20', '6', '24', '1', '20');
INSERT INTO `rel_orders` VALUES ('21', '6', '24', '1', '21');
INSERT INTO `rel_orders` VALUES ('22', '4', '27', '1', '22');

-- ----------------------------
-- Table structure for setup
-- ----------------------------
DROP TABLE IF EXISTS `setup`;
CREATE TABLE `setup` (
  `id` tinyint(10) unsigned NOT NULL AUTO_INCREMENT,
  `web_title` varchar(120) NOT NULL COMMENT '站点标题',
  `web_keywords` varchar(120) NOT NULL COMMENT '站点关键词',
  `web_description` varchar(255) NOT NULL COMMENT '站点描述',
  `web_icp` varchar(32) NOT NULL COMMENT '备案号',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of setup
-- ----------------------------

-- ----------------------------
-- Table structure for shop_detail
-- ----------------------------
DROP TABLE IF EXISTS `shop_detail`;
CREATE TABLE `shop_detail` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(32) NOT NULL COMMENT '账号',
  `password` varchar(64) NOT NULL COMMENT '密码',
  `addtime` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '注册时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of shop_detail
-- ----------------------------
INSERT INTO `shop_detail` VALUES ('1', 'changtianfei', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-10 15:14:14');
INSERT INTO `shop_detail` VALUES ('2', 'sangdaheng', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-10 15:50:45');
INSERT INTO `shop_detail` VALUES ('3', 'wangjiankai', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-13 16:03:05');
INSERT INTO `shop_detail` VALUES ('4', 'lixuwen', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-13 16:08:43');
INSERT INTO `shop_detail` VALUES ('5', 'lianleilei', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-13 16:27:09');
INSERT INTO `shop_detail` VALUES ('6', '18612175264', 'e10adc3949ba59abbe56e057f20f883e', '2017-07-17 16:04:53');

-- ----------------------------
-- Table structure for shop_detail_copy
-- ----------------------------
DROP TABLE IF EXISTS `shop_detail_copy`;
CREATE TABLE `shop_detail_copy` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `cid` int(10) NOT NULL,
  `shopname` varchar(255) DEFAULT NULL COMMENT '商家名称',
  `picname` varchar(255) DEFAULT NULL COMMENT '商户图片',
  `phone` varchar(14) DEFAULT NULL COMMENT '手机',
  `legal` varchar(16) DEFAULT NULL COMMENT '法人代表',
  `id_card` char(18) DEFAULT NULL COMMENT '身份证号',
  `city` varchar(255) DEFAULT NULL COMMENT '城市',
  `region` varchar(255) DEFAULT NULL COMMENT '区，县',
  `address` varchar(255) DEFAULT NULL COMMENT '地址',
  `licence` varchar(255) DEFAULT NULL,
  `status` int(3) unsigned DEFAULT '1' COMMENT '1,未审核2,通过审核',
  `addtime` timestamp NULL DEFAULT NULL ON UPDATE CURRENT_TIMESTAMP COMMENT '注册时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of shop_detail_copy
-- ----------------------------
INSERT INTO `shop_detail_copy` VALUES ('1', '1', 'CGV星聚汇影城', '14999410435514.jpeg', '010-82816767', '常田飞', '130622199212187016', '北京市', '昌平区', '经济技术开发区荣京东街大族广场9号楼三层', '14999410426150.png', '4', '2017-07-14 15:32:59');
INSERT INTO `shop_detail_copy` VALUES ('2', '2', 'UME国际影城', '14999409587592.jpeg', '14730304472', '桑大亨', '130622199212187018', '北京市', '海淀区', '双榆树科学院南路44号（双安商场对面）', '14999409588982.png', '4', '2017-07-14 15:33:04');
INSERT INTO `shop_detail_copy` VALUES ('3', '3', '博兴齐纳国际影城', '14999330374467.jpeg', '14730304472', '王建凯', '130622199212187014', '北京市', '海淀区', '兄弟连1203', '14999330373507.png', '1', '2017-07-13 16:03:56');
INSERT INTO `shop_detail_copy` VALUES ('4', '4', 'CGV星聚汇影城', '15002528115069.jpeg', '14730304472', '李旭文', '130622199212187015', '北京市', '通州区', '兄弟连1203', '15002528115575.png', '4', '2017-07-17 08:53:30');
INSERT INTO `shop_detail_copy` VALUES ('5', '5', '星聚汇影', '14999352042588.jpeg', '14730304472', '连磊磊', '130622199212187017', '北京市', '昌平区', '兄弟连1203', '14999352042291.jpeg', '1', '2017-07-13 16:40:03');
INSERT INTO `shop_detail_copy` VALUES ('6', '6', '111111', '15002787565786.jpeg', '18612175264', '常天飞', '131025199508293632', '北京市', '朝阳区', 'hhhh', '15002787558322.jpeg', '4', '2017-07-17 16:08:10');

-- ----------------------------
-- Table structure for shop_region
-- ----------------------------
DROP TABLE IF EXISTS `shop_region`;
CREATE TABLE `shop_region` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `city` varchar(255) NOT NULL COMMENT '城市',
  `level` int(3) unsigned NOT NULL,
  `upid` mediumint(8) unsigned NOT NULL COMMENT '父id',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=40 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of shop_region
-- ----------------------------
INSERT INTO `shop_region` VALUES ('1', '北京市', '1', '0');
INSERT INTO `shop_region` VALUES ('2', '河北省', '1', '0');
INSERT INTO `shop_region` VALUES ('3', '天津市', '1', '0');
INSERT INTO `shop_region` VALUES ('4', '朝阳区', '2', '1');
INSERT INTO `shop_region` VALUES ('5', '海淀区', '2', '1');
INSERT INTO `shop_region` VALUES ('6', '通州区', '2', '1');
INSERT INTO `shop_region` VALUES ('7', '房山区', '2', '1');
INSERT INTO `shop_region` VALUES ('8', '丰台区', '2', '1');
INSERT INTO `shop_region` VALUES ('9', '昌平区', '2', '1');
INSERT INTO `shop_region` VALUES ('10', '大兴区', '2', '1');
INSERT INTO `shop_region` VALUES ('11', '顺义区', '2', '1');
INSERT INTO `shop_region` VALUES ('12', '西城区', '2', '1');
INSERT INTO `shop_region` VALUES ('13', '石景山区', '2', '1');
INSERT INTO `shop_region` VALUES ('14', '石家庄市', '2', '2');
INSERT INTO `shop_region` VALUES ('15', '唐山市', '2', '2');
INSERT INTO `shop_region` VALUES ('16', '保定市', '2', '2');
INSERT INTO `shop_region` VALUES ('17', '邯郸市', '2', '2');
INSERT INTO `shop_region` VALUES ('18', '邢台市', '2', '2');
INSERT INTO `shop_region` VALUES ('19', '河北区', '2', '2');
INSERT INTO `shop_region` VALUES ('20', '沧州市', '2', '2');
INSERT INTO `shop_region` VALUES ('21', '秦皇岛市', '2', '2');
INSERT INTO `shop_region` VALUES ('22', '张家口市', '2', '2');
INSERT INTO `shop_region` VALUES ('23', '衡水市', '2', '2');
INSERT INTO `shop_region` VALUES ('24', '廊坊市', '2', '2');
INSERT INTO `shop_region` VALUES ('25', '承德市', '2', '2');
INSERT INTO `shop_region` VALUES ('26', '和平区', '2', '3');
INSERT INTO `shop_region` VALUES ('27', '北辰区', '2', '3');
INSERT INTO `shop_region` VALUES ('28', '河北区', '2', '3');
INSERT INTO `shop_region` VALUES ('29', '河西区', '2', '3');
INSERT INTO `shop_region` VALUES ('30', '西青区', '2', '3');
INSERT INTO `shop_region` VALUES ('31', '津南区', '2', '3');
INSERT INTO `shop_region` VALUES ('32', '东丽区', '2', '3');
INSERT INTO `shop_region` VALUES ('33', '武清区', '2', '3');
INSERT INTO `shop_region` VALUES ('34', '宝坻区', '2', '3');
INSERT INTO `shop_region` VALUES ('35', '红桥区', '2', '3');
INSERT INTO `shop_region` VALUES ('36', '大港区', '2', '3');
INSERT INTO `shop_region` VALUES ('37', '汉沽区', '2', '3');
INSERT INTO `shop_region` VALUES ('38', '静海县', '2', '3');
INSERT INTO `shop_region` VALUES ('39', '塘沽区', '2', '3');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `uid` int(11) DEFAULT NULL,
  `phone` varchar(11) NOT NULL,
  `password` varchar(255) NOT NULL,
  `login_ip` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('3', '3', '14730304472', 'eyJpdiI6IkdlaXhGdHFPaHdERE0yajE0NHVFcmc9PSIsInZhbHVlIjoid3JiVk9pVE1UVHdWc28xSkluMDlcL0E9PSIsIm1hYyI6IjEyN2MyY2QzMDI2OTg4ZGE0NDRhOWViY2NhNTI1YTk0Yzc0ZmJlYWI4YmJmNzFiMmZjNjNkZTQwMjA4MjU3Y2EifQ==', '127.0.0.1');
INSERT INTO `users` VALUES ('2', '2', '18712753959', 'e1adab62a0a474c4988386d5f2380d76', '127.0.0.1');
INSERT INTO `users` VALUES ('4', '4', '13681333005', 'fa83b5ec76b71d3380bfe3d4c0b11bb8', '127.0.0.1');
INSERT INTO `users` VALUES ('5', '5', '13949080053', 'fa83b5ec76b71d3380bfe3d4c0b11bb8', '127.0.0.1');
INSERT INTO `users` VALUES ('6', '6', '13681333992', 'd63abd5ae10babe0919988122890503d', '127.0.0.1');

-- ----------------------------
-- Table structure for users_detail
-- ----------------------------
DROP TABLE IF EXISTS `users_detail`;
CREATE TABLE `users_detail` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `nickname` varchar(255) DEFAULT NULL,
  `sex` int(1) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `status` int(1) NOT NULL DEFAULT '1',
  `email` varchar(255) DEFAULT NULL,
  `firsttime` int(20) DEFAULT NULL,
  `lasttime` int(20) DEFAULT NULL,
  `money` double(10,0) DEFAULT '5000',
  PRIMARY KEY (`id`),
  KEY `unique` (`nickname`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users_detail
-- ----------------------------
INSERT INTO `users_detail` VALUES ('1', null, null, null, '1', null, '1499669025', null, '5000');
INSERT INTO `users_detail` VALUES ('2', '', null, 'hhhh', '2', null, '1499669418', '1500273943', '3588');
INSERT INTO `users_detail` VALUES ('3', null, null, null, '1', null, '1499741053', null, '5000');
INSERT INTO `users_detail` VALUES ('4', '爱迪生', '1', '山东省青岛市ddd', '1', 'admin@admin.com', '1499829603', '1500280779', '4569');
INSERT INTO `users_detail` VALUES ('5', '连雷雷', '1', '山西省长治市壶关县80号', '1', 'lianleilei1990@qq.com', '1499829603', '1500021677', '5000');
INSERT INTO `users_detail` VALUES ('6', null, null, null, '1', null, '1500275542', '1500278296', '4685');
